#ifndef  __API_WORK_STATE_H__
#define  __API_WORK_STATE_H__

#include "main.h"

/******************************************************************************
 *                               定义运行状态
*******************************************************************************/
typedef enum
{
    RUN_OFF = 0,                    //关机
    RUN_ON  = 1                     //开机
} RUN_STATE;

/******************************************************************************
 *                           定义本机工作状态变量类型
*******************************************************************************/
typedef struct
{
    RUN_STATE run_state;            //运行状态
    
} WORK_STATE_STRUCT;

/******************************************************************************
 *                              外部变量声明
*******************************************************************************/
extern WORK_STATE_STRUCT work_state;

/******************************************************************************
 *                              外部函数声明
*******************************************************************************/
//extern void work_state_init(void);
extern void work_control_task(void);
extern void work_even_task(void);
extern WORK_STATE_STRUCT* work_state_RequestInfo(void);
#endif
