/******************************************************************************
 *                                  头文件
*******************************************************************************/
#include "driver_irc.h"

/******************************************************************************
 *                             定义红外发码控制变量
*******************************************************************************/
uint16_t irc_output_timing[512];            //红外发码时序缓存
volatile uint16_t irc_output_num;            //红外发码时序数量
uint16_t irc_output_index;                  //红外发码时序索引
volatile uint8_t irc_output_busy_flag;      //红外发码运行中标志

//----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
//uint16_t irc_output_timing[256] = { 0x01100, 0x010EE, 0x0021A, 0x0063C, 0x0021C, 0x0021A, 0x0021C, 0x0063C, 0x0021C, 0x0063A, 0x0021E, 0x00218, 0x0021E, 0x0021A, 0x0021C, 0x0063C, 
//                                    0x0021A, 0x0021A, 0x0021E, 0x00218, 0x0021C, 0x0063E, 0x0021A, 0x0021C, 0x0021C, 0x0021A, 0x0021C, 0x0063A, 0x0021E, 0x0063A, 0x0021C, 0x00236, 
//                                    0x00200, 0x0063C, 0x0021C, 0x0063C, 0x0021C, 0x00238, 0x001FE, 0x00238, 0x001FE, 0x0063C, 0x0021A, 0x0063C, 0x0021C, 0x0063C, 0x0021C, 0x0063C, 
//                                    0x0021C, 0x0063C, 0x0021A, 0x0021C, 0x0021C, 0x0063C, 0x0021A, 0x0063C, 0x0021C, 0x0021A, 0x0021C, 0x0021A, 0x0021C, 0x0021A, 0x0021E, 0x00218, 
//                                    0x0021E, 0x00218, 0x0021C, 0x0021A, 0x0021C, 0x0021A, 0x0021E, 0x0063C, 0x0021A, 0x0021C, 0x0021C, 0x0021A, 0x0021A, 0x0021C, 0x0021A, 0x0021C, 
//                                    0x0021A, 0x0021C, 0x0021C, 0x0063C, 0x0021A, 0x0063E, 0x0021A, 0x0021C, 0x0021A, 0x0063E, 0x0021A, 0x0063E, 0x0021A, 0x0063C, 0x0021C, 0x0063E, 
//                                    0x00218, 0x0063E, 0x0021A, 0x0140C, 0x01100, 0x010EE, 0x00218, 0x0063E, 0x0021A, 0x0021E, 0x00218, 0x0063E, 0x00218, 0x00640, 0x00216, 0x00220, 
//                                    0x00216, 0x00220, 0x00212, 0x00646, 0x001FC, 0x0023A, 0x001FC, 0x0023A, 0x001FC, 0x0065E, 0x001F8, 0x0023C, 0x001FA, 0x0023C, 0x001FA, 0x00674, 
//                                    0x001E2, 0x00676, 0x001E0, 0x00240, 0x001F6, 0x00676, 0x001E2, 0x00676, 0x001E0, 0x00256, 0x001E0, 0x00256, 0x001DE, 0x00678, 0x001E0, 0x00678, 
//                                    0x001DC, 0x0067A, 0x001DE, 0x0067A, 0x001DC, 0x0067A, 0x001DC, 0x0025A, 0x001DA, 0x0067E, 0x001D8, 0x00680, 0x001D6, 0x0025E, 0x001D8, 0x0025E, 
//                                    0x001D8, 0x00260, 0x001D6, 0x00260, 0x001D6, 0x00260, 0x001D6, 0x00260, 0x001D6, 0x00260, 0x001D6, 0x0069A, 0x001BE, 0x00260, 0x001D4, 0x00262, 
//                                    0x001D6, 0x00260, 0x001D4, 0x00262, 0x001D4, 0x00262, 0x001D6, 0x0069A, 0x001BC, 0x0069A, 0x001BE, 0x00278, 0x001BE, 0x0069A, 0x001BC, 0x0069A, 
//                                    0x001BE, 0x0069A, 0x001BE, 0x0069A, 0x001BC, 0x0069A, 0x001BE, 0x01100 };
//----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

/******************************************************************************
 * FunctionName : tim17_ocx_duty
 * Description  : 设置TIM17_OCx输出PWM的占空比
 * Parameters   : none
 * Returns      : none
*******************************************************************************/
static void tim3_ocx_duty(uint8_t oc_num, float duty)
{
    switch (oc_num)
    {
        case 1 :
        case 2 :
        case 3 :
        case 4 :
            TIM3->CCR3 = (TIM3->ARR) * duty / 100;
            break;
        default :
            ;
    }
}

/******************************************************************************
 * FunctionName : irc_output_level_ctrl
 * Description  : 红外发码输出电平控制
 * Parameters   : none
 * Returns      : none
*******************************************************************************/
void irc_output_level_ctrl(uint8_t level)
{
    (level) ? (tim3_ocx_duty(1, 0)) :      //无调制波形输出，接收端为高电平
              (tim3_ocx_duty(1, 30));      //输出调制波形，接收端为低电平
}

/******************************************************************************
 * FunctionName : irc_output_timing_ctrl
 * Description  : 红外发码输出时序控制（以us为单位）
 * Parameters   : none
 * Returns      : none
*******************************************************************************/
void irc_output_timing_ctrl(uint16_t time)
{
    LL_TIM_SetAutoReload(TIM16, time);
    LL_TIM_EnableCounter(TIM16);
}

/******************************************************************************
 * FunctionName : irc_output_start
 * Description  : 红外发码启动
 * Parameters   : none
 * Returns      : none
*******************************************************************************/
void irc_output_start(void)
{
    if (!irc_output_busy_flag)
    {
        irc_output_index = 0;
        irc_output_level_ctrl(irc_output_index % 2);
        irc_output_timing_ctrl(irc_output_timing[irc_output_index++]);
        
        irc_output_busy_flag = 1;
    }
}

/******************************************************************************
 * FunctionName : irc_init
 * Description  : 红外控制功能初始化
 * Parameters   : none
 * Returns      : none
*******************************************************************************/
void irc_init(void)
{
    irc_output_level_ctrl(1);
    
    irc_output_index = 0;
    irc_output_busy_flag = 0;
    
    //------------------------
//    irc_output_num = 200;
//    irc_output_start();
    //------------------------
}
